/*********************************************************************************
* Copyright(C),2013-2017,MediaTek Inc.
* FileName:	drivers.c
* Author:		Guangye.Yang
* Version:	V1.2
* Date:		2013/9/29
* Description: drivers模块解析
**********************************************************************************/
#include "android/logger.h"
#include "drivers.h"


/*************************************************************************
*========================== init/deinit section ==========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	初始化drivers模块
*
* PARAMETERS
*	无
*
* RETURNS
*	0: drivers模块关闭
*	1: drivers模块可用
*
* GLOBAL AFFECTED
*
*************************************************************************/
int DriversInit(void)
{
	LoggerInit();

	return 1;
}

/*************************************************************************
* DESCRIPTION
*	注销drivers模块
*
* PARAMETERS
*	无
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void DriversDeInit(void)
{
	LoggerDeInit();
}