/*********************************************************************************
* Copyright(C),2013-2017,MediaTek Inc.
* FileName:	mm.c
* Author:		Guangye.Yang
* Version:	V1.2
* Date:		2013/9/29
* Description: mm模块解析
**********************************************************************************/
#include <mrdump.h>
#include "page.h"
#include "slub.h"
#include "mm.h"


/*************************************************************************
*============================= local section =============================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	设置内存区域所在vma句柄名字
*
* PARAMETERS
*	pVmaHdl: vma句柄
*	pArg: 参数
*
* RETURNS
*	0: 成功
*	1: 失败
*
* LOCAL AFFECTED
*
*************************************************************************/
static int SetMemName(VMA_HDL *pVmaHdl, void *pArg)
{
	VmaSetAttr(pVmaHdl, pArg, VMA_IGNORE|VMA_ATTR(pVmaHdl));
	return 0;
}


/*************************************************************************
*========================== init/deinit section ==========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	初始化mm模块
*
* PARAMETERS
*	无
*
* RETURNS
*	0: mm模块关闭
*	1: mm模块可用
*
* GLOBAL AFFECTED
*
*************************************************************************/
int MmInit(void)
{
#ifndef SST64
	TryMergeVma(0xFFFF0000, 0xFFFF1000, SetMemName, "vectors");
#endif
	PageInit();
	SlubInit();
	return 1;
}

/*************************************************************************
* DESCRIPTION
*	注销mm模块
*
* PARAMETERS
*	无
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void MmDeInit(void)
{
	SlubDeInit();
	PageDeInit();
}
