/*********************************************************************************
* Copyright(C),2013-2017,MediaTek Inc.
* FileName:	exception.h
* Author:		Guangye.Yang
* Version:	V1.0
* Date:		2013/7/25
* Description: 异常解析
**********************************************************************************/
#ifndef _EXCEPTION_H
#define _EXCEPTION_H

#include <stdio.h>


/*************************************************************************
*============================= track section =============================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	分析异常并生成报告
*
* PARAMETERS
*	fp: 文件句柄
*	pOutFile: 输出文件名
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void ExceptionTrack(FILE *fp, const char *pOutFile);

#endif