/*********************************************************************************
* Copyright(C),2014-2017,MediaTek Inc.
* FileName:	script_gen.h
* Author:		Guangye.Yang
* Version:	V1.0
* Date:		2014/5/5
* Description: 生成cmm/gdb脚本
**********************************************************************************/
#ifndef _SCRIPT_GEN_H
#define _SCRIPT_GEN_H


/*************************************************************************
*=========================== external section ===========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	启动脚本程序
*
* PARAMETERS
*	Type: 0: trace32, 1: gdb
*
* RETURNS
*	0: 成功
*	1: 失败
*
* GLOBAL AFFECTED
*
*************************************************************************/
int StartScriptProgram(int Type);

/*************************************************************************
* DESCRIPTION
*	根据coredump生成脚本(cmm脚本、gdb脚本)
*
* PARAMETERS
*	无
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void GenScript(void);

/*************************************************************************
* DESCRIPTION
*	根据nelog生成cmm脚本
*
* PARAMETERS
*	无
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void NelogGenCmm(void);

#endif
