/*********************************************************************************
* Copyright(C),2013-2017,MediaTek Inc.
* FileName:	dwarf.h
* Author:		Guangye.Yang
* Version:	V1.2
* Date:		2013/3/11
* Description: dwarf解析(支持dwarf2~4)
**********************************************************************************/
#ifndef _DWARF_H
#define _DWARF_H

#include <ttypes.h>
#include "dwframe.h"
#include "dwinfo.h"


/*************************************************************************
*=========================== external section ===========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	获取无符号LEB128值
*
* PARAMETERS
*	pVal: 返回无符号LEB128值
*	p: 指针
*
* RETURNS
*	更新后的指针
*
* GLOBAL AFFECTED
*
*************************************************************************/
const void *Getleb128(TSIZE *pVal, const void *p);

/*************************************************************************
* DESCRIPTION
*	获取有符号LEB128值
*
* PARAMETERS
*	pVal: 返回有符号LEB128值
*	p: 指针
*
* RETURNS
*	更新后的指针
*
* GLOBAL AFFECTED
*
*************************************************************************/
const void *Getsleb128(TSSIZE *pVal, const void *p);

#endif
