/*****************************************************************************
* Copyright(C),2017-2017,MediaTek Inc.
* FileName:	logeigenclient.h
* Author:		chao.peng
* Version:	V1.0
* Date:		2017/3/15
* Description:
******************************************************************************/
#ifndef _LOGEIGENCLIENT_H
#define _LOGEIGENCLIENT_H


/*************************************************************************
*=========================== external section ===========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	显示关联的Cr信息
*
* PARAMETERS
*	fp: 输出到的文件
*	pCrId: Cr id, 为NULL则不记录
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void DispAndRecRelatedCr(FILE *fp, const char *pCrId);

#endif
