/*********************************************************************************
* Copyright(C),2015-2017,MediaTek Inc.
* FileName:	reference.h
* Author:		Guangye.Yang
* Version:	V1.0
* Date:		2015/4/8
* Description: 参考信息显示
**********************************************************************************/
#ifndef _REFERENCE_H
#define _REFERENCE_H

#include <stdio.h>


/*************************************************************************
*=========================== external section ===========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	显示参考信息
*
* PARAMETERS
*	fp: 文件句柄
*	pLibName: 符号文件名, 可以为NULL
*
* RETURNS
*	无
*
* GLOBAL AFFECTED
*
*************************************************************************/
void DispRefInf(FILE *fp, const char *pLibName);

#endif
