/*********************************************************************************
* Copyright(C),2016-2017,MediaTek Inc.
* FileName:	rb_reason_tracker.h
* Author:		Guangye.Yang
* Version:	V1.0
* Date:		2016/7/1
* Description: 重启信息模块解析
**********************************************************************************/
#ifndef _RB_REASON_TRACKER_H
#define _RB_REASON_TRACKER_H

#include <stdio.h>


/*************************************************************************
*=========================== external section ===========================
*************************************************************************/
/*************************************************************************
* DESCRIPTION
*	分析last dbg信息
*
* PARAMETERS
*	fp: 文件句柄
*
* RETURNS
*	0: 正常
*	1: 存在异常
*
* GLOBAL AFFECTED
*
*************************************************************************/
int LastDbgInfCheck(FILE *fp);

#endif
